hpmicro/zephyr_sdk_glue/include/dt-bindings/clock/hpm6360-clocks.h
/*
 * Copyright (c) 2024 HPMicro
 *SPDX-License-Identifier: Apache-2.0
 */

#ifndef ZEPHYR_INCLUDE_DT_BINDINGS_CLOCK_HPM6360_CLOCKS_H
#define ZEPHYR_INCLUDE_DT_BINDINGS_CLOCK_HPM6360_CLOCKS_H

/*
 *
 *<---------------------- AUTO_GENERATE ---------------------->
 *    This file was auto-generated, do not edit anything.
 *    generated on 2024-09-13 14:28:09 
 */

#define CLK_SRC_OSC24M  0
#define CLK_SRC_PLL0_CLK0  1
#define CLK_SRC_PLL0_CLK1  2
#define CLK_SRC_PLL0_CLK2  3
#define CLK_SRC_PLL1_CLK0  4
#define CLK_SRC_PLL1_CLK1  5
#define CLK_SRC_PLL2_CLK0  6
#define CLK_SRC_PLL2_CLK1  7
#define CLK_SRC_OSC32K  8
#define CLK_ADC_SRC_ANA0  16
#define CLK_ADC_SRC_ANA1  16
#define CLK_ADC_SRC_ANA2  16
#define CLK_ADC_SRC_AHB0  17
#define CLK_DAC_SRC_ANA3  112
#define CLK_DAC_SRC_AHB0  113
#define CLK_I2S_SRC_AUD0  32
#define CLK_I2S_SRC_AUD1  33
#define CLK_WDG_SRC_AHB0  48
#define CLK_WDG_SRC_OSC32K  49
#define CLK_PWDG_SRC_OSC24M  176
#define CLK_PWDG_SRC_OSC32K  177
#define CLK_SRC_INVALID  255

#define CLOCK_CPU0  2556
#define CLOCK_MCHTMR0  17235968
#define CLOCK_FEMC  16973825
#define CLOCK_XPI0  17301506
#define CLOCK_XPI1  17367043
#define CLOCK_GPTMR0  18153476
#define CLOCK_GPTMR1  18219013
#define CLOCK_GPTMR2  18284550
#define CLOCK_GPTMR3  18350087
#define CLOCK_UART0  18415624
#define CLOCK_UART1  18481161
#define CLOCK_UART2  18546698
#define CLOCK_UART3  18612235
#define CLOCK_UART4  18677772
#define CLOCK_UART5  18743309
#define CLOCK_UART6  18808846
#define CLOCK_UART7  18874383
#define CLOCK_I2C0  18939920
#define CLOCK_I2C1  19005457
#define CLOCK_I2C2  19070994
#define CLOCK_I2C3  19136531
#define CLOCK_SPI0  19202068
#define CLOCK_SPI1  19267605
#define CLOCK_SPI2  19333142
#define CLOCK_SPI3  19398679
#define CLOCK_CAN0  19464216
#define CLOCK_CAN1  19529753
#define CLOCK_SDXC0  20578342
#define CLOCK_NTMR0  20512805
#define CLOCK_AHB  4294772222
#define CLOCK_AXI  4294772477
#define CLOCK_AXIC  16910077
#define CLOCK_AXIS  16844541
#define CLOCK_AHBP  16778750
#define CLOCK_PTPC  19595290
#define CLOCK_PTP0  4294836258
#define CLOCK_REF0  20709411
#define CLOCK_REF1  20774948
#define CLOCK_WATCHDOG0  17957632
#define CLOCK_WATCHDOG1  18023169
#define CLOCK_PUART  4294902784
#define CLOCK_PTMR  4294902785
#define CLOCK_PWDG  4294904576
#define CLOCK_ETH0  20447265
#define CLOCK_SDP  17434112
#define CLOCK_XDMA  17696257
#define CLOCK_ROM  17040898
#define CLOCK_RAM0  17171971
#define CLOCK_USB0  20645380
#define CLOCK_KMAN  17564928
#define CLOCK_GPIO  17827073
#define CLOCK_MBX0  17892610
#define CLOCK_HDMA  17630468
#define CLOCK_RNG  17499397
#define CLOCK_MOT0  20317446
#define CLOCK_MOT1  20382983
#define CLOCK_ACMP  19924234
#define CLOCK_PDM  20120064
#define CLOCK_DAO  20185601
#define CLOCK_SYNT  20251917
#define CLOCK_FFA0  17761550
#define CLOCK_LMM0  17107200
#define CLOCK_TSNS  18090240
#define CLOCK_ANA0  4294901787
#define CLOCK_ANA1  4294901788
#define CLOCK_ANA2  4294901789
#define CLOCK_ADC0  19661056
#define CLOCK_ADC1  19726593
#define CLOCK_ADC2  19792130
#define CLOCK_ANA3  4294901790
#define CLOCK_DAC0  19859200
#define CLOCK_AUD0  4294901791
#define CLOCK_AUD1  4294901792
#define CLOCK_I2S0  19988992
#define CLOCK_I2S1  20054529
#define CLK_OSC0CLK0  2099712
#define CLK_PLL0CLK0  2230785
#define CLK_PLL0CLK1  2296322
#define CLK_PLL0CLK2  2361859
#define CLK_PLL1CLK0  2492932
#define CLK_PLL1CLK1  2558469
#define CLK_PLL2CLK0  2689542
#define CLK_PLL2CLK1  2755079


#endif  /* ZEPHYR_INCLUDE_DT_BINDINGS_CLOCK_HPM6360_CLOCKS_H */
